{
    "@context": "https://w3id.org/codemeta/3.0",
    "type": "SoftwareSourceCode",
    "applicationCategory": "Multiscale modeling with varying submodel fidelity",
    "author": [
        {
            "id": "https://orcid.org/0000-0002-8340-4718",
            "type": "Person",
            "affiliation": {
                "type": "Organization",
                "name": "Department of Civil and Environmental Engineering, Rice University, Houston, TX, USA"
            },
            "email": "raul.rincon@rice.edu",
            "familyName": "Rincon",
            "givenName": "Raul"
        },
        {
            "id": "https://orcid.org/0000-0002-7484-2871",
            "type": "Person",
            "affiliation": {
                "type": "Organization",
                "name": "Department of Civil and Environmental Engineering, Rice University, Houston, TX, USA"
            },
            "email": "jamie.padgett@rice.edu",
            "familyName": "Padgett",
            "givenName": "Jamie Ellen"
        }
    ],
    "codeRepository": "https://github.com/rinconraul/IdentifyingEfficientSubmodelFidelityCombinations/tree/main",
    "dateCreated": "2025-12-14",
    "dateModified": "2026-01-15",
    "datePublished": "2026-01-15",
    "description": "Not all submodels that encompass infrastructure system performance assessment achieve the same level of fidelity. Even if all reach high-fidelity levels, the required information for accurate regional-scale analysis may not be available. Therefore, this code determines whether a combination of lower-fidelity submodels yields a more efficient Monte Carlo (MC) estimate than using the Most Accurate But Expensive (MABE) model. Rather than leveraging multifidelity MC methods, our approach identifies whether submodels can be completely replaced by reduced-fidelity models without affecting the quality of outcomes. The Python code for identifying ‘efficient submodel fidelity combinations’ in multiscale models is 'Efficient_submodel_fidelity_combinations.py'. Additionally, we have added a model generator function, 'Funct.py'. The latter is used to exemplify the Python class `Efficient_model_selection` (found in the main script). Also, a Jupyter Notebook accompanies the illustrative example and illustrates the convergence plots of the function. Researchers, modelers, and decision-makers can benefit from procedures that objectively guide model selection. By using this type of selection criterion, we are advocating for multiscale models that are defined at a level of fidelity that suits the intended purpose of the analysis. This project is based on the following manuscript: Rincon R, Padgett JE. (2026). “Identifying submodel fidelity combinations that yield efficient multiscale models for infrastructure performance estimation.” Reliability Engineering and System Safety, In Review, January 2026."
    "funder": {
        "type": "Organization",
        "name": "U.S. National Science Foundation"
    },
    "keywords": [
        "multiscale models",
        "uncertainty propagation",
        "model efficiency",
        "fragility",
        "network reliability",
        "infrastructure resilience",
        "bias"
    ],
    "license": "https://spdx.org/licenses/BSD-3-Clause",
    "name": "IdentifyingEfficientSubmodelFidelityCombinations",
    "operatingSystem": "Windows",
    "programmingLanguage": "Python 3",
    "version": "1.0.0",
    "funding": "Award Number CMMI-2227467"
}